# Normal Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Plane..::..Normal Property
Plane Class See Also
---
Plane normal.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public XYZ Normal { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Normal As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Normal {
	XYZ^ get ();
}
```

# See Also
Plane Class
Autodesk.Revit.DB Namespace